Tekla Open API Reference for Tekla Structures 2025
ICurve.Clone Method
 Returns a deep copy of the geometry
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
ICurve Clone()
Function Clone As ICurve
Return Value
Type: ICurve
Copy of self
See Also
Reference
ICurve Interface
Tekla.Structures.Geometry3d Namespace